[UI_TREE]
Machine = Hardware Einstellungen
POWER = Leistungsmerkmale
TOUCH = Fußpedal Einstellung

[IPG,CO2]
IPG,CO2 = Glasfaser,CO2
MPULSE_FREQ = Pulsfrequenz beibehalten (khz)
MPULSE_RELS = anhaltende Freisetzungszeit (uns)

[IPG]
IPG=Faserlaser
MO_DELAY_STEPS=MO Verzögerung (uns)
MODECHG_DELAY=Mode Schaltverzögerung (ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE = Geben Sie den aktuellen Wert im Dialogfeld ein
WORK_CURRENT_TYPEOption = Layer 0 current | Set value
WORK_CURRENT = Arbeitsstrom einstellen (A)

[ALL]
SAFE_DOOR = Sicherheitstürschutz
SAFE_DOOROption = Ungültig|Pause|Abbruch
MARKEND_SCAN = Markierung der Endgalvanometerposition
MARKEND_SCANOption =Origine|In alto a sinistra|Posizione in alto al centro|Centro in alto a destra|Centro in basso|Centro in basso | Angolo in basso | Angolo in basso|Angolo sinistro|Centro sinistro|Posizione personalizzata
MARKEND_X = X Koordinate beim Anpassen (mm)
MARKEND_Y = Y Koordinate beim Anpassen (mm)

[SCAN]
PREHEAT_ENABLE = Muss das Galvanometer vorgewärmt werden?
PREHEAT_ENABLEOption = Nein|Ja
PREHEAT_TIME = Mindestvorwärmzeit (Minuten)
USE_LIMIT_JUMPDELAY = Ob Sprungverzögerung aktiviert werden soll
USE_LIMIT_JUMPDELAYOption = Nein|Ja
LIMIT_JUMPLEN = Limit Jump Distance (mm)
LIMIT_JUMPDELAY_MM = Sprungzeit pro mm (uns)

[BitmapPower]
BitmapPower = Graustufen-Bitmap-Markierung
AUT_TIME = Zerfallszeit (uns)
AUT_COFF = Verstärkungskoeffizient (0-1)

[Signal]
Signal = Signaleinstellung
Cycle = Trigger mehrmals wirksam
MARK_CNT = wie oft mit einem einzigen Markierbefehl markiert werden soll
DELAY = Verzögerung nach Auslösung (ms)
DLY_BETWEEN_MARK = Verzögerung zwischen zwei Markierungen (ms)
MARK_END_DELAY = Verzögerung nach Abschluss der Markierung (ms)
MARK_END_PULSE_W = Markierung Endsignallänge (ms)
B_MARK_ONCE = Auslösemodus
B_MARK_ONCEOption = Level-Trigger | Edge-Trigger
Enable_Loop_Mdt = Schleifenmarkierung nach Offline
Enable_Loop_MdtOption = Nicht aktivieren | aktivieren
IOSELCOUNT = Anzahl der I/O ausgewählten Dokumentsignale
ENABLE_CARDTOUCH = Untere Maschine ausgelöst
ENABLE_CARDTOUCHOption = Nicht aktivieren | aktivieren

[UI_FACE]
ExportSysPara = Exportparameter
ImportSysPara = Importparameter
OK = OK
Cancel = Abbrechen
Apply = Anwenden

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------

[DIALOG_LASERSET]
0=Assistent zur Einstellung von Laserhardware-Parametern
1=Vorheriger Schritt
2=Nächster Schritt
3=Speichern
4=Abbrechen

[DIALOG_POWER]
0=Schritt 2: Legen Sie die Hardwarekonfiguration Ihres ausgewählten Lasers fest
1=Aktueller Regelbereich (%)
2=Mindeststrom (%):
3=Maximalstrom (A):
4=Q-Antrieb simulieren
5=Digitaler Q-Antrieb
6=Q-Antriebstyp
7=Stromversorgungsart
8=CO2 Laserleistung
9=normale Stromversorgung
10=Schnelllaufspannung
11=größer oder gleich 100W
12=weniger als 100W
13=Pulseinstellung beibehalten
14=Frequenz (KHZ)
15=Freigabezeit (uns)
16=Leerstrom (%):
17=maximaler Betriebszyklus
18=Ausgleichsstrom (%)
19=Einstellungen der Laserhardware
20=M Wert Einstellung
21=M Wert:
22=Einstellkoeffizient:
23=normal
24=zu groß
25=zu klein

[DIALOG_MODEL]
0=Schritt 4: Wählen Sie Ihre bevorzugte Steuerungsmethode basierend auf Ihren Präferenzen
1=Eine brandneue Kontrollmethode, einfach zu bedienen, und Benutzer müssen keine Verzögerung einstellen, sondern können nur auf einigen Lasern verwendet werden.
2=Traditionelle Laserkontrollmethode, in Übereinstimmung mit den Nutzungsgewohnheiten der meisten Menschen, können alle Laser diese Methode verwenden.
3=Einfacher Modus
4=Traditioneller Modus
5=Kontrollmodus für die Lasermarkierung
6=Viereckkopf Typ
7=Einzelkopfmodus
8=Doppelkopfmodus

[DIALOG_LaserType]

0=Laser Typ:

1=YAGLaser

2=DPLaser

3=UV-laser

4=CO2Laser

5=TonQFaser-laser

6=SPILaser

7=LDLaser

8=YLPM(HFM-H)Laser

9=YLP-V2Laser

10=YLPPLaser

11=HFM-ALaser

12=HFM-PLaser

13=HFM-RLaser

14=HFM-JLaser

15=MOPAEinstellbaren Puls Breite, die laser -

16=kontinuierlicher Faserlaser

17=Ultraschneller Laser


[DIALOG_CONTENT]

0=Fünfter Schritt: herzlichen Glückwunsch an Sie, Ihre Einstellungen abgeschlossen haben, speichern Sie bitte die relevanten Parameter

[LaserType_Explain]

0=YAGLaser

1=DPLaser

2=UV-laser

3=CO2Laser

4=TonQFaser-laser

5=SPILaser

6=LDLaser

7=MoPaFaser-laser

8=YLP-V2Laser

9=YLPPLaser

10=HFM-ALaser

11=HFM-PLaser

12=HFM-QLaser

13=HFM-JLaser

14=sonstige


[Model_Explain]

0=CO2 Einfach-Modus

1=CO2 Traditionelle mode

2= TonQ Normale Stromversorgung+DigitalQ Traditionelle mode

3= TonQ Normale Stromversorgung+AnalogQ Traditionelle mode

4= TonQ, Quick response power supply+DigitalQ Traditionelle mode

5= TonQ, Quick response power supply+AnalogQ Traditionelle mode

6= TonQ Normale Stromversorgung+AnalogQ Einfach-Modus

7= TonQ, Quick response power supply+DigitalQ Einfach-Modus

8= TonQ, Quick response power supply+AnalogQ Einfach-Modus

9= IPG Modus

10=SPI Einfach-Modus

11=SPI Traditionelle mode

12=LD Modus

13=YLPM(HFM-H) Traditionelle mode

14=YLPM(HFM-H) Einfach-Modus

15=YLP-V2 Traditionelle mode

16=YLP-V2 Einfach-Modus

17=YLPP Traditionelle mode

18=YLPP Einfach-Modus

19=HFM-A Traditionelle mode

20=HFM-A Einfach-Modus

21=HFM-P Traditionelle mode

22=HFM-P Einfach-Modus

23=HFM-R Traditionelle mode

24=HFM-R Einfach-Modus

25=HFM-J Traditionelle mode

26=HFM-J Einfach-Modus


[DIALOG_ScanType]

0=Dritter Schritt: Set galvanometer Typ

1=Hausgemachte galvanometer

2=Andere galvanometer

3=Tipps:Bitte wählen Sie die Maschine entsprechend der galvanometer-Typ, Hausgemachte galvanometer nach power-on-warm-up um richtig zu arbeiten,Andere galvanometer ohne Vorheizen

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------

;--------------------------------- BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------
[PORTDIALOGTEXT]
STATIC_0=Bearbeitungseingang stoppen
STATIC_1=Beenden des Bearbeitungsausgangs
STATIC_2=Ausgabeport
STATIC_3=Sicherheitstür
STATIC_4=Eingangsport
STATIC_5=Laser bereit für Ausgabeport
STATIC_6=Eingangsport
STATIC_7=Ausgangsport
STATIC_8=Software ready output port
STATIC_9=Ausgabeport
STATIC_10=Laserausgang
STATIC_11=Port
STATIC_12=Ausgang der roten Anzeige
STATIC_13=Ausgangsport
STATIC_14=Eingangsport
STATIC_15=Begleitmarkierung
STATIC_16=Ausgangsport
STATIC_17=Markierung des Ausgangsports
STATIC_18=Ausgangsport
STATIC_19=Impulsbreite
STATIC_20=Faserlaser Alarmausgang
STATIC_21=Ausgangsport
STATIC_22=Port markieren
STATIC_23=Eingangsport
IDC_CHECK_LASERWARN=Laseralarm erkennen
IDC_CHECK_PLUSE_REVERSE=Q Signalpegelumkehr
IDC_RADIO_NORMAL = Standard
IDC_RADIO_BICOLORLAMP = Zweifarbiges Licht
IDC_RADIO_TRICOLORLIGHT = dreifarbiges Licht

[error]
1=Karte nicht initialisiert oder kann nicht gefunden werden!
2=Zurücksetzen fehlgeschlagen!
3=Falsche Kartenversion!
4=Alarm!
6=Ausführung fehlgeschlagen!
7=Status entspricht nicht!
16=Kommando Timeout!
17=Kommando verloren!
18=Interface Aufruf asynchron!
19=Schnittstelle belegt von anderen Programmen!
20=Z-Achse überschreitet Limit oder Korrekturdatei ist beschädigt!
21=Parameterfehler!
23=Speicherzuweisung fehlgeschlagen!
100=im Offline-Betrieb!
101=Befehl abgebrochen!
1001=Port 1
1002=Port 2
1003=Port 3
1004=Port 4
1005=Port 5
1006=Port 6
1007=Port 7
1008=Lasereingang nicht bereit
1009=Lasereingang bereit


;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg---------------------------------

; ---------------------------------BEGIN: EMCC\HansLaserSet. dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= Lasereinstellung
IDD_PROPPAGE_POWER= Eigenschaften des Netzteils
IDD_PROPPAGE_SYS_SET=Hardware-Einstellungen
IDD_PROPPAGE_TOUCH= Pedaleinstellungen
IDD_PORT_SET = Port-Einstellungen

[IDD_DIALOG_HANSLASERSET]
CAPTION=Systemeinstellungen
IDC_BTN_SAVE= Konservieren
IDCANCEL= Beenden
LISTTITLE_NAME= Name des Elements
LISTTITLE_VALUE= Wert

; ---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
